Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AutoDetectIgnoreLeaderWarning Property
 Analytical Model for Structural Element has reset to its default location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AutoDetectIgnoreLeaderWarning { get; }
Public Shared ReadOnly Property AutoDetectIgnoreLeaderWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AutoDetectIgnoreLeaderWarning {
	FailureDefinitionId^ get ();
}
static member AutoDetectIgnoreLeaderWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace